# Name - SANKALP JAIN  ML_Nov3

# STEP 1 - Dataset Understanding

Importing all necessary libraries

In [1]:
import numpy as np
import pandas as pd
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
import matplotlib.pyplot as plt
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import confusion_matrix,accuracy_score,precision_score,recall_score

Importing dataset

In [4]:
df=pd.read_excel('default of credit card clients_Nov3.xls')

Dataset Analysis

In [6]:
df.shape

(30001, 25)

Making the column names more descriptive

In [15]:
df.columns=df.iloc[0]

In [20]:
df=df[1:]

In [26]:
df.reset_index(inplace=True)

Printing column names

In [27]:
df.columns

Index(['index', 'ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE',
       'PAY_0', 'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1',
       'BILL_AMT2', 'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6',
       'PAY_AMT1', 'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object', name=0)

Describing the dataset

In [32]:
df.describe(include='all')

,index,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
count,29998.000000,29998.0,29998.0,29998.0,29998.0,29998.0,29998.0,29998.0,29998.0,29998.0,...,29998.0,29998.0,29998.0,29998.0,29998.0,29998.0,29998.0,29998.0,29998.0,29998.0
unique,NaN,29998.0,81.0,2.0,7.0,4.0,56.0,11.0,11.0,11.0,...,21547.0,21009.0,20603.0,7943.0,7899.0,7518.0,6937.0,6897.0,6939.0,2.0
top,NaN,30000.0,50000.0,2.0,2.0,2.0,29.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
freq,NaN,1.0,3365.0,18110.0,14028.0,15963.0,1605.0,14737.0,15730.0,15763.0,...,3194.0,3505.0,4019.0,5247.0,5396.0,5967.0,6407.0,6701.0,7172.0,23364.0
mean,15001.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,8659.821024,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,3.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,7502.250000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,15001.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,22500.750000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,30000.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Printing first three rows of our dataset

In [30]:
df.head(3)

,index,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,3,3,90000,2,2,2,34,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
1,4,4,50000,2,2,1,37,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
2,5,5,50000,1,2,1,57,-1,0,-1,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

Printing the **target** variable

In [33]:
target=df['default payment next month']
target

0        0
1        0
2        0
3        0
4        0
        ..
29993    0
29994    0
29995    1
29996    1
29997    1
Name: default payment next month, Length: 29998, dtype: object

Dropping **index** and **ID** column as they do not give any useful information

In [36]:
df.drop(columns=['index','ID'],inplace=True)
df.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,90000,2,2,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
1,50000,2,2,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
2,50000,1,2,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
3,50000,1,1,2,37,0,0,0,0,0,...,19394,19619,20024,2500,1815,657,1000,1000,800,0
4,500000,1,1,2,29,0,0,0,0,0,...,542653,483003,473944,55000,40000,38000,20239,13750,13770,0

In [40]:
df.columns

Index(['LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_0', 'PAY_2',
       'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object', name=0)

Generating new columns from existing columns. DIFF columns will contain the balance after subtracting the paid amount from bill amount

In [44]:
df['DIFF1']=df["BILL_AMT1"]-df['PAY_AMT1']
df['DIFF2']=df["BILL_AMT2"]-df['PAY_AMT2']
df['DIFF3']=df["BILL_AMT3"]-df['PAY_AMT3']
df['DIFF4']=df["BILL_AMT4"]-df['PAY_AMT4']
df['DIFF5']=df["BILL_AMT5"]-df['PAY_AMT5']
df['DIFF6']=df["BILL_AMT6"]-df['PAY_AMT6']

In [45]:
df.columns

Index(['LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_0', 'PAY_2',
       'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month', 'DIFF1', 'DIFF2', 'DIFF3', 'DIFF4',
       'DIFF5', 'DIFF6'],
      dtype='object', name=0)

Dropping unnecessary columns

In [46]:
df.drop(columns=['BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6'],inplace=True)
df.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,default payment next month,DIFF1,DIFF2,DIFF3,DIFF4,DIFF5,DIFF6
0,90000,2,2,2,34,0,0,0,0,0,0,0,27721,12527,12559,13331,13948,10549
1,50000,2,2,1,37,0,0,0,0,0,0,0,44990,46214,48091,27214,27890,28547
2,50000,1,2,1,57,-1,0,-1,0,0,0,0,6617,-31011,25835,11940,18457,18452
3,50000,1,1,2,37,0,0,0,0,0,0,0,61900,55254,56951,18394,18619,19224
4,500000,1,1,2,29,0,0,0,0,0,0,0,312965,372023,407007,522414,469253,460174

Calculating mean of different columns

In [47]:
df.mean()

0
LIMIT_BAL                     167490.822055
SEX                                1.603707
EDUCATION                          1.853124
MARRIAGE                           1.551870
AGE                               35.486199
PAY_0                             -0.016734
PAY_2                             -0.133909
PAY_3                             -0.166178
PAY_4                             -0.220648
PAY_5                             -0.266151
PAY_6                             -0.291119
default payment next month         0.221148
DIFF1                          45562.568071
DIFF2                          43260.691113
DIFF3                          41790.180279
DIFF4                          38439.358991
DIFF5                          35514.265784
DIFF6                          33658.459697
dtype: float64

Calculating standard deviation of different columns

In [48]:
df.std()

0
LIMIT_BAL                     129748.902717
SEX                                0.489135
EDUCATION                          0.790374
MARRIAGE                           0.521971
AGE                                9.217810
PAY_0                              1.123764
PAY_2                              1.197099
PAY_3                              1.196897
PAY_4                              1.169168
PAY_5                              1.133180
PAY_6                              1.149908
default payment next month         0.415027
DIFF1                          73175.414858
DIFF2                          72567.557461
DIFF3                          69296.877444
DIFF4                          64202.027859
DIFF5                          60554.758626
DIFF6                          60152.691321
dtype: float64

# STEP 2 - Preprocessing of Data

Getting an overview of our data

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29998 entries, 0 to 29997
Data columns (total 18 columns):
LIMIT_BAL                     29998 non-null object
SEX                           29998 non-null object
EDUCATION                     29998 non-null object
MARRIAGE                      29998 non-null object
AGE                           29998 non-null object
PAY_0                         29998 non-null object
PAY_2                         29998 non-null object
PAY_3                         29998 non-null object
PAY_4                         29998 non-null object
PAY_5                         29998 non-null object
PAY_6                         29998 non-null object
default payment next month    29998 non-null object
DIFF1                         29998 non-null object
DIFF2                         29998 non-null object
DIFF3                         29998 non-null object
DIFF4                         29998 non-null object
DIFF5                         29998 non-null object
DIFF6                         29998 non-null object
dtypes: object(18)
memory usage: 4.1+ MB

There are no missing values present in our dataset and all columns are categorical in nature. Therefore we have to convert them to numerical

Separating our target variable or label from rest of the dataset

In [61]:
y=df['default payment next month']
df.drop(columns='default payment next month',inplace=True)

In [78]:
y=y.astype(int)
y.dtype

dtype('int32')

Converting Categorical columns to numerical columns

In [67]:
for col in df.columns:
    df[col]=df[col].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29998 entries, 0 to 29997
Data columns (total 17 columns):
LIMIT_BAL    29998 non-null int32
SEX          29998 non-null int32
EDUCATION    29998 non-null int32
MARRIAGE     29998 non-null int32
AGE          29998 non-null int32
PAY_0        29998 non-null int32
PAY_2        29998 non-null int32
PAY_3        29998 non-null int32
PAY_4        29998 non-null int32
PAY_5        29998 non-null int32
PAY_6        29998 non-null int32
DIFF1        29998 non-null int32
DIFF2        29998 non-null int32
DIFF3        29998 non-null int32
DIFF4        29998 non-null int32
DIFF5        29998 non-null int32
DIFF6        29998 non-null int32
dtypes: int32(17)
memory usage: 1.9 MB

In [68]:
X=df
X.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,DIFF1,DIFF2,DIFF3,DIFF4,DIFF5,DIFF6
0,90000,2,2,2,34,0,0,0,0,0,0,27721,12527,12559,13331,13948,10549
1,50000,2,2,1,37,0,0,0,0,0,0,44990,46214,48091,27214,27890,28547
2,50000,1,2,1,57,-1,0,-1,0,0,0,6617,-31011,25835,11940,18457,18452
3,50000,1,1,2,37,0,0,0,0,0,0,61900,55254,56951,18394,18619,19224
4,500000,1,1,2,29,0,0,0,0,0,0,312965,372023,407007,522414,469253,460174

Standardising our features dataset to avoid any bias

In [69]:
sc=StandardScaler()
X_new=pd.DataFrame(sc.fit_transform(X))
X_new.columns=X.columns
X_new.index=X.index

In [70]:
X_new.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,DIFF1,DIFF2,DIFF3,DIFF4,DIFF5,DIFF6
0,-0.597247,0.810205,0.185835,0.858549,-0.161234,0.014892,0.111863,0.138843,0.188725,0.234875,0.253172,-0.243823,-0.423525,-0.421832,-0.391090,-0.356151,-0.384186
1,-0.905540,0.810205,0.185835,-1.057299,0.164228,0.014892,0.111863,0.138843,0.188725,0.234875,0.253172,-0.007825,0.040698,0.090927,-0.174847,-0.125909,-0.084976
2,-0.905540,-1.234255,0.185835,-1.057299,2.333977,-0.874989,0.111863,-0.696665,0.188725,0.234875,0.253172,-0.532231,-1.023500,-0.230248,-0.412756,-0.281688,-0.252802
3,-0.905540,-1.234255,-1.079410,0.858549,0.164228,0.014892,0.111863,0.138843,0.188725,0.234875,0.253172,0.223268,0.165274,0.218784,-0.312228,-0.279013,-0.239968
4,2.562756,-1.234255,-1.079410,0.858549,-0.703671,0.014892,0.111863,0.138843,0.188725,0.234875,0.253172,3.654327,4.530506,5.270409,7.538433,7.162872,7.090666

# STEP 3 - Applying Algorithm

1. Dividing dataset into Train and Test Data

In [114]:
X_train,X_test,y_train,y_test=train_test_split(X_new,y,stratify=y,random_state=36,test_size=0.3)

Using Logistic Regression to solve our problem

In [115]:
lr=LogisticRegression(random_state=40)

Fitting the data into Logistic Regression model

In [116]:
lr.fit(X_train,y_train)

C:\Users\sanka\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=40, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

Predicting

In [123]:
y_pred=lr.predict(X_test)

# STEP 4 - Performance Evaluation Measures

Generating Confusion matrix

In [129]:
confusion_matrix(y_pred,y_test)

array([[6826, 1502],
       [ 184,  488]], dtype=int64)

Calculating accuracy score

In [125]:
accuracy_score(y_pred,y_test)

0.8126666666666666

Calculating recall score

In [126]:
recall_score(y_pred,y_test)

0.7261904761904762

Calculating precision score

In [127]:
precision_score(y_test,y_pred)

0.7261904761904762